## "Обратный отсчет"

### Задание

Выведите все целые числа от n до 0 включительно.

### Формат входных данных

Дано целое положительно число n.

### Формат выходных данных

Выведите все числа, требуемые по условию задачи.

### Решение задачи

n = int(input("n:"))
i = 0

while n > i:
    print(n)
    n -= 1
